create_item.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="csfoodkirtiload.qcepvp5t4b.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="5" unit="second"></users>
    </arrivalphase>
    <!--<arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="30" unit="second"></users>
    </arrivalphase>-->
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"></option>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511
        Firefox/1.0.4
      </user_agent>
    </option>
  </options>

  <sessions>
    <session name="create-item" probability="100" type="ts_http">
      <request>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>
      <request subst="true">
        <http url='/users/sign_in' version='1.1' method='POST'
              contents="user%5Blogin%5D=kirtibhandari%40umail.ucsb.edu&amp;user%5Bpassword%5D=csfood&amp;user%5Bremember_me%5D=0&amp;commit=Log+in"></http>
     </request>
      <setdynvars sourcetype="random_string" length="5">
        <var name="itemName"/>
      </setdynvars>
      <request>
        <http url='/items/new' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request subst="true">
        <http url='/items' version='1.1' method='POST'
              contents="commit=Create+Item&amp;
              item%5Bname%5D=%%_itemName%%&amp;
              utf8=%E2%9C%93"></http>
      </request>
    </session>
  </sessions>
</tsung>