first_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="34.216.125.43" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="50" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="100" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="150" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="60" unit="second">
      <users arrivalrate="200" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="60" unit="second">
      <users arrivalrate="250" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"></option>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511
        Firefox/1.0.4
      </user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <request>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/users/sign_up' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request url='/users' version='1.1' method='POST'
               contents='commit=Sign+up&
        user%5Bbirthday%5D=1900%2F10%2F10&
        user%5Bemail%5D=sdlkfj%40gmail.com&
        user%5Bfirst_name%5D=slkdfjslkdjf&
        user%5Blast_name%5D=slkdj&
        user%5Bpassword%5D=Appfolio55%25&
        user%5Bpassword_confirmation%5D=Appfolio55%25&
        user%5Bphone_number%5D=456-456-4567&
        user%5Busername%5D=slkdfjsldkjf&
        utf8=%E2%9C%93'>
      </request>
    </session>
  </sessions>
</tsung>