random_order_mix_5items.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="cs-food-nidhi2.dwhrmmxnpa.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="50" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="100" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="150" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="200" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"></option>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511
      Firefox/1.0.4
      </user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <setdynvars sourcetype="random_string" length="20">
        <var name="oname"/>
      </setdynvars>
      <setdynvars sourcetype="random_string" length="10">
        <var name="iname"/>
      </setdynvars>
      <setdynvars sourcetype="random_string" length="20">
        <var name="iname"/>
      </setdynvars>
      <setdynvars sourcetype="random_string" length="40">
        <var name="iname1"/>
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rndusr"/>
      </setdynvars>
      <request>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request subst="true">
        <http url='/users/sign_in' version='1.1' method='POST'
              contents="user%5Blogin%5D=user%%_rndusr%%%40gmail.com&amp;user%5Bpassword%5D=test1234&amp;user%5Bremember_me%5D=0&amp;commit=Log+in"></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request>
        <http url='/orders/new' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request subst="true">
        <http url='/orders' version='1.1' method='POST'
              contents="commit=Save+Order&amp;order%5Btext%5D=%%_oname%%&amp;order%5Btitle%5D=%%_oname%%&amp;order%5Bitem_1_text%5D=%%_iname%%&amp;order%5Bitem_2_text%5D=%%_iname1%%&amp;order%5Bitem_3_text%5D=%%_iname%%&amp;order%5Bitem_4_text%5D=%%_iname1%%&amp;order%5Bitem_5_text%5D=%%_iname%%&amp;"></http>
      </request>
    </session>
  </sessions>
</tsung>