sign_in.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="csfoodkirtiload.r2g39dyjt3.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="5" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="30" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"></option>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511
      Firefox/1.0.4
      </user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rndusr"/>
      </setdynvars>
      <request>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      <request subst="true">
        <http url='/users/sign_in' version='1.1' method='POST'
              contents="user%5Blogin%5D=user%%_rndusr%%%40gmail.com&amp;user%5Bpassword%5D=test1234&amp;user%5Bremember_me%5D=0&amp;commit=Log+in"></http>
      </request>
    </session>
  </sessions>
</tsung>